function pow(x, n) /* пропущен пробел */ {
  // фигурная скобка не на той строке
  let result = 1; // пробелы
  // пустые строки после операторов
  for (let i = 0; i < n; i++) {
    // пробелы и фигурные скобки
    result *= x; // пробелы
  }
  // пустые строки после операторов
  return result;
}

let x = prompt("x?", ""); // пробелы, кавычки и нет точки с запятой.
let n = prompt("n?", ""); // разбить на две строки для читаемости

if (n <= 0) {
  // пробелы и фигурная скобка
  alert(`Степень ${n} не поддерживается, 
    введите целую степень, большую 0`); // слишком длинная строка
} else {
  // лишние переносы строк
  alert(pow(x, n)); // пробелы
}
